In [1]:
import numpy as np
a = [1,2, 3, 4]
b = np.array([1, 2, 3, 4])
print(a)
print(b)

[1, 2, 3, 4]
[1 2 3 4]

In [2]:
print(a[1])
print(b[1])

2
2

In [3]:
print(a[0:2])
print(b[0:2])

[1, 2]
[1 2]

In [4]:
c = a * 2
d = b * 2
print(c, d)

[1, 2, 3, 4, 1, 2, 3, 4] [2 4 6 8]

In [5]:
e = [[1, 2], [3, 4], [5, 6]]
f = np.array(e)

In [6]:
print(e)
print(f)

[[1, 2], [3, 4], [5, 6]]
[[1 2]
 [3 4]
 [5 6]]

In [7]:
x = np.arange(5)
y = np.arange(5, 10)
z = np.arange(5, 10, 2)
print(x)
print(y)
print(z)

[0 1 2 3 4]
[5 6 7 8 9]
[5 7 9]

In [11]:
r1 = np.random.randn(4) #follow mean=0 n=1 random=4
r2 = np.arange(16).reshape(4, 4)
r3 = np.random.randint(0, 99, (5, 5))

print("\n",r1)
print("\n",r2)
print("\n",r3)

 [ 0.30261253 -0.74768668  0.5327304  -0.62705386]

 [[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]]

 [[87 19 19 26 23]
 [21 95 69 38 42]
 [ 5 92  5 89 74]
 [62 34 12 42 28]
 [51 57  1 13 22]]

## Pandas: panel data

In [13]:
import pandas as pd
s1 = pd.Series(['one', 'two', 'three'])
print(s1)

0      one
1      two
2    three
dtype: object

In [16]:
s2 = pd.DataFrame([[1, 2], [3, 4], [5, 6]])
print(s2)

   0  1
0  1  2
1  3  4
2  5  6

In [17]:
a = pd.DataFrame()
date = [1, 3, 5]
score = [2, 4, 6]
a['date'] = date
a['score'] = score
print(a)

   date  score
0     1      2
1     3      4
2     5      6

In [23]:
b = pd.DataFrame({'a': [1, 3, 5], 'b': [2, 4, 6]}, index=['x', 'y', 'z'])
print(b)

   a  b
x  1  2
y  3  4
z  5  6

In [24]:
c = pd.DataFrame.from_dict({'a': [1, 3, 5], 'b': [2, 4, 6]}, orient="index")
print(c)

   0  1  2
a  1  3  5
b  2  4  6

In [26]:
d = pd.DataFrame(np.arange(12).reshape(3, 4), index=['x', 'y', 'z'], columns=['A', 'B', 'C', 'D'])
print(d)

   A  B   C   D
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [27]:
d = d.rename(index={'x':'TSLA', 'y':'APPL', 'z':'CVX'}, columns={'A':'Date','B':'High','C':'Low', 'D':'Price'})
print(d)

      Date  High  Low  Price
TSLA     0     1    2      3
APPL     4     5    6      7
CVX      8     9   10     11

In [29]:
d

      Date  High  Low  Price
TSLA     0     1    2      3
APPL     4     5    6      7
CVX      8     9   10     11

In [32]:
d.to_csv('data.csv')

In [33]:
data = pd.read_csv('data.csv')
print(data)

  Unnamed: 0  Date  High  Low  Price
0       TSLA     0     1    2      3
1       APPL     4     5    6      7
2        CVX     8     9   10     11

In [34]:
d

      Date  High  Low  Price
TSLA     0     1    2      3
APPL     4     5    6      7
CVX      8     9   10     11

In [35]:
data

  Unnamed: 0  Date  High  Low  Price
0       TSLA     0     1    2      3
1       APPL     4     5    6      7
2        CVX     8     9   10     11

In [36]:
a = data['Date']

In [41]:
b = data[1:3]
d = data.iloc[1:3]
print(b)
print(d)

  Unnamed: 0  Date  High  Low  Price
1       APPL     4     5    6      7
2        CVX     8     9   10     11
  Unnamed: 0  Date  High  Low  Price
1       APPL     4     5    6      7
2        CVX     8     9   10     11

In [44]:
e = data.head()
print(e)

  Unnamed: 0  Date  High  Low  Price
0       TSLA     0     1    2      3
1       APPL     4     5    6      7
2        CVX     8     9   10     11

In [45]:
data

  Unnamed: 0  Date  High  Low  Price
0       TSLA     0     1    2      3
1       APPL     4     5    6      7
2        CVX     8     9   10     11

In [46]:
data['Range'] = data['High'] - data['Low']

In [47]:
data

  Unnamed: 0  Date  High  Low  Price  Range
0       TSLA     0     1    2      3     -1
1       APPL     4     5    6      7     -1
2        CVX     8     9   10     11     -1

In [49]:
df1 = pd.DataFrame({'CMP':['Vanke', 'Ali', 'Baidu'], 'Score':[90, 95, 85]})
df2 = pd.DataFrame({'CMP':['', 'Ali', 'Baidu'], 'Price':[180, 175, 195]})
df3 = pd.merge(df1, df2)
print(df3)

     CMP  Score  Price
0    Ali     95    175
1  Baidu     85    195

In [50]:
df4 = pd.merge(df1, df2, how='outer')
print(df4)

     CMP  Score  Price
0  Vanke   90.0    NaN
1    Ali   95.0  175.0
2  Baidu   85.0  195.0
3           NaN  180.0

In [52]:
date_list = list(pd.date_range('2020-09-01', '2020-10-02'))
print(date_list)

[Timestamp('2020-09-01 00:00:00', freq='D'), Timestamp('2020-09-02 00:00:00', freq='D'), Timestamp('2020-09-03 00:00:00', freq='D'), Timestamp('2020-09-04 00:00:00', freq='D'), Timestamp('2020-09-05 00:00:00', freq='D'), Timestamp('2020-09-06 00:00:00', freq='D'), Timestamp('2020-09-07 00:00:00', freq='D'), Timestamp('2020-09-08 00:00:00', freq='D'), Timestamp('2020-09-09 00:00:00', freq='D'), Timestamp('2020-09-10 00:00:00', freq='D'), Timestamp('2020-09-11 00:00:00', freq='D'), Timestamp('2020-09-12 00:00:00', freq='D'), Timestamp('2020-09-13 00:00:00', freq='D'), Timestamp('2020-09-14 00:00:00', freq='D'), Timestamp('2020-09-15 00:00:00', freq='D'), Timestamp('2020-09-16 00:00:00', freq='D'), Timestamp('2020-09-17 00:00:00', freq='D'), Timestamp('2020-09-18 00:00:00', freq='D'), Timestamp('2020-09-19 00:00:00', freq='D'), Timestamp('2020-09-20 00:00:00', freq='D'), Timestamp('2020-09-21 00:00:00', freq='D'), Timestamp('2020-09-22 00:00:00', freq='D'), Timestamp('2020-09-23 00:00:00', freq='D'), Timestamp('2020-09-24 00:00:00', freq='D'), Timestamp('2020-09-25 00:00:00', freq='D'), Timestamp('2020-09-26 00:00:00', freq='D'), Timestamp('2020-09-27 00:00:00', freq='D'), Timestamp('2020-09-28 00:00:00', freq='D'), Timestamp('2020-09-29 00:00:00', freq='D'), Timestamp('2020-09-30 00:00:00', freq='D'), Timestamp('2020-10-01 00:00:00', freq='D'), Timestamp('2020-10-02 00:00:00', freq='D')]

In [53]:
import datetime
for i in range(len(date_list)):
    date_list[i] = datetime.datetime.strftime(date_list[i], '%Y-%m-%d')
print(date_list)

['2020-09-01', '2020-09-02', '2020-09-03', '2020-09-04', '2020-09-05', '2020-09-06', '2020-09-07', '2020-09-08', '2020-09-09', '2020-09-10', '2020-09-11', '2020-09-12', '2020-09-13', '2020-09-14', '2020-09-15', '2020-09-16', '2020-09-17', '2020-09-18', '2020-09-19', '2020-09-20', '2020-09-21', '2020-09-22', '2020-09-23', '2020-09-24', '2020-09-25', '2020-09-26', '2020-09-27', '2020-09-28', '2020-09-29', '2020-09-30', '2020-10-01', '2020-10-02']